app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "contacts"
---
  def index
  @contacts = Contact.order(:name).page(params[:page]).per(15)

SELECT "kinds".* FROM "kinds"
---
  	def set_options_for_select
		@kind_options_for_select = Kind.all