app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @kinds = Kind.all

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "123"], ["created_at", "2017-09-29 03:11:31.710148"], ["updated_at", "2017-09-29 03:11:31.710148"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 4]]
---
  def destroy
    @kind.destroy