app/controllers/phones_controller.rb

SELECT "phones".* FROM "phones"
---
  def index
    respond_to do |format|
      format.html { @phones = Phone.all }

SELECT  "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_phone
      @phone = Phone.find(params[:id])